In [1]:
%load_ext sql

In [2]:
%%sql
sqlite:///CourseDataWareHouse.db

'Connected: @CourseDataWareHouse.db'

## Domain integrity

Check Data Types for tables

In [3]:
%%sql
SELECT typeof(CC_ID),typeof(COURSE_TITLE),typeof(PRE_REQS),typeof(CO_REQS)
FROM COURSES
limit 1;

 * sqlite:///CourseDataWareHouse.db
Done.

[('integer', 'text', 'null', 'null')]

In [4]:
%%sql
SELECT typeof(ROOM_ID),typeof(ROOM_NO)
FROM MEETINGS
limit 1;

 * sqlite:///CourseDataWareHouse.db
Done.

[('integer', 'text')]

In [5]:
%%sql
SELECT typeof(I_ID),typeof(NAME),typeof(COURSE_TITLE)
FROM PROFESSOR
limit 1;

 * sqlite:///CourseDataWareHouse.db
Done.

[('integer', 'text', 'text')]

In [7]:
%%sql
SELECT typeof(TIME_ID), typeof(START_TIME), typeof(END_TIME)
FROM TIME
limit 1;

 * sqlite:///CourseDataWareHouse.db
Done.

[('integer', 'text', 'text')]

In [25]:
%%sql
SELECT typeof(CF_ID), typeof(ACT), typeof(CAP),typeof(REM), typeof(CC_ID), typeof(I_ID)
, typeof(ROOM_ID), typeof(TIME_ID), typeof(TERM_NAME), typeof(CRN)
FROM COURSE_FACTS
where room_id is not null
and time_id is not null
limit 1;

 * sqlite:///CourseDataWareHouse.db
Done.

[('integer', 'integer', 'integer', 'integer', 'integer', 'integer', 'integer', 'integer', 'text', 'integer')]

## Entity integrity

Check for duplicates in tables

In [11]:
%%sql
SELECT COUNT(CC_ID)
FROM COURSES;

 * sqlite:///CourseDataWareHouse.db
Done.

[(2220,)]

In [12]:
%%sql
SELECT DISTINCT COUNT(CC_ID)
FROM COURSES;

 * sqlite:///CourseDataWareHouse.db
Done.

[(2220,)]

In [15]:
%%sql
SELECT COUNT(ROOM_ID)
FROM MEETINGS;

 * sqlite:///CourseDataWareHouse.db
Done.

[(13032,)]

In [16]:
%%sql
SELECT DISTINCT COUNT(ROOM_ID)
FROM MEETINGS;

 * sqlite:///CourseDataWareHouse.db
Done.

[(13032,)]

In [17]:
%%sql
SELECT COUNT(I_ID)
FROM PROFESSOR;

 * sqlite:///CourseDataWareHouse.db
Done.

[(14330,)]

In [18]:
%%sql
SELECT DISTINCT COUNT(I_ID)
FROM PROFESSOR;

 * sqlite:///CourseDataWareHouse.db
Done.

[(14330,)]

In [19]:
%%sql
SELECT COUNT(TIME_ID)
FROM TIME;

 * sqlite:///CourseDataWareHouse.db
Done.

[(296781,)]

In [20]:
%%sql
SELECT DISTINCT COUNT(TIME_ID)
FROM TIME;

 * sqlite:///CourseDataWareHouse.db
Done.

[(296781,)]

In [23]:
%%sql
SELECT COUNT(ACT)
FROM COURSE_FACTS;

 * sqlite:///CourseDataWareHouse.db
Done.

[(2899784,)]

In [24]:
%%sql
SELECT DISTINCT COUNT(ACT)
FROM COURSE_FACTS;

 * sqlite:///CourseDataWareHouse.db
Done.

[(2899784,)]

## Relational integrity

Foreign Keys Joins compatible with the Primary Keys

In [27]:
%%sql
SELECT *
FROM COURSE_FACTS a, TIME b, PROFESSOR c, MEETINGS d, COURSES e
WHERE a.TIME_ID=b.TIME_ID
and a.I_ID=c.i_ID
and a.ROOM_ID=d.ROOM_ID
and a.CC_ID=e.CC_ID
limit 1;

 * sqlite:///CourseDataWareHouse.db
Done.

[(29166, 0, 0, 0, 0, 0, 0, 1101, 5074, 5363, 119417, 'Fall2018', 74970, 119417, '2018-09-05T11:00:00', '2018-09-05T13:30:00', 5363, 'Catherine J.  Andersen', 'Biology Research IV', 5074, 'BNW 127', 1101, 'Biology Research IV', None, None)]